<h2>Menu 5</h2>


500만화소, 30프레임, 풀스크린 지원!!

끊김없이 영화를 보듯 뚜렷한 화질로 영어가 머리에 쏙쏙!
보고 듣는 방식이 다릅니다. 잉글리쉬 월드 화상영어만의 화상영어 시스템, 하드웨어 구성
자세히 살펴보시면 전용회선의 차이가 보입니다. 한번만 비교하시면 화질의 차이를 느낄 수 있습니다.
1. 검증된 언어교육이론과 교수법을 바탕으로 개발된 체계적 교육 프로그램
Krashen 교수의 자연교수법(Natural Approcach)과 의사소통중심 언어교수법
(CLT:Communicative Language Teaching)을 통합한 최고의 언어 교육프로그램입니다.
원어민 강사와 함께 하는 영어사용환경과 '학습'사실을 의식하지 않고 오직 의사소통을 위하여 언어를 사용하고 있다는 사실만 의식할 수 있도록 체계적으로 개발된 잉글리쉬 월드 화상영어 프로그램을 통하여 자연스럽게 영어를 습득하도 록 합니다.
2. 인공지능 기반의 학습자 맞춤식 영어학습센터
대용량 국제전용회선(45M), 자체 Teaching Center구축
핵심 기술 확보로 개인(1:1)및 그룹(1:n)맞춤식 수업지원